
INSERT INTO students(full_name, group_number) VALUES
('Иван', 1),
('Матвей', 1),
('Кирилл', 1),
('Егор', 1),
('Миша', 1),
('Паша', 1);  

INSERT INTO subjects(subject_name) VALUES
('Математический анализ'),
('Аналитическая геометрия'),
('Информатика');  

INSERT INTO grades(student_id, subject_id, grade) VALUES
(1, 1, 5), (1, 2, 4), (1, 3, 5),
(2, 1, 4), (2, 2, 3), (2, 3, 5),
(3, 1, 5), (3, 2, 5), (3, 3, 4),
(4, 1, 3), (4, 2, 4), (4, 3, 3),
(5, 1, 4), (5, 2, 5), (5, 3, 5),
(6, 1, 2), (6, 2, 3), (6, 3, 4);  

INSERT INTO attendance (student_id, date_attended, status) VALUES
(1, '2024-01-15', 'present'),
(2, '2024-01-15', 'present'),
(3, '2024-01-15', 'present'),
(4, '2024-01-15', 'absent'),
(5, '2024-01-15', 'present'),
(6, '2024-01-15', 'late'),
(1, '2024-01-16', 'present'),
(2, '2024-01-16', 'absent'),
(3, '2024-01-16', 'present'),
(4, '2024-01-16', 'present'),
(5, '2024-01-16', 'excused'),
(6, '2024-01-16', 'present');  

INSERT INTO notes (student_id, note_text) VALUES 
(1, 'Иван - Любит информатику'),
(2, 'Матвей - Нужна помощь по информатике'),  
(3, 'Кирилл - Редко посещает занятия по информатике'),
(4, 'Егор - Отличник по всем предметам'),  
(5, 'Миша - Хорошо работает в команде'),
(6, 'Паша - Прогресс по информатике'); 